#Использовать ".."
#Использовать 1bdd
#Использовать 1testrunner

Функция ПрогнатьТесты()
	
	Тестер = Новый Тестер;

	ПутьКТестам = ОбъединитьПути(ТекущийСценарий().Каталог, "..", "tests");
	
	ФайлПутьКТестам = Новый Файл(ПутьКТестам);
	Если Не ФайлПутьКТестам.Существует() Тогда
		Сообщить("Не найден каталог тестов " + ПутьКТестам);
		Возврат Ложь;
	КонецЕсли;

	ПутьКОтчетуJUnit = ОбъединитьПути(ТекущийСценарий().Каталог, "..");

	РезультатТестирования = Тестер.ТестироватьКаталог(
		Новый Файл(ПутьКТестам),
		Новый Файл(ПутьКОтчетуJUnit)
	);

	Успешно = РезультатТестирования = 0;
	
	Возврат Успешно;
КонецФункции // ПрогнатьТесты()

Функция ПрогнатьФичи()
	
	ПутьОтчетаJUnit = "./bdd-log.xml";

	КаталогФич = ОбъединитьПути(".", "features");

	ИсполнительБДД = Новый ИсполнительБДД;

	Файл_КаталогФич = Новый Файл(КаталогФич);
	Если Не Файл_КаталогФич.Существует() Тогда
		Сообщить("Не найден каталог фич " + КаталогФич);
		Возврат Истина;
	КонецЕсли;

	РезультатыВыполнения = ИсполнительБДД.ВыполнитьФичу(Файл_КаталогФич, Файл_КаталогФич);
	ИтоговыйРезультатВыполнения = ИсполнительБДД.ПолучитьИтоговыйСтатусВыполнения(РезультатыВыполнения);

	СтатусВыполнения = ИсполнительБДД.ВозможныеСтатусыВыполнения().НеВыполнялся;
	Если РезультатыВыполнения.Строки.Количество() > 0 Тогда
		
		СтатусВыполнения = ИсполнительБДД.ПолучитьИтоговыйСтатусВыполнения(РезультатыВыполнения);
		
	КонецЕсли;

	ГенераторОтчетаJUnit = Новый ГенераторОтчетаJUnit;
	ГенераторОтчетаJUnit.Сформировать(РезультатыВыполнения, СтатусВыполнения, ПутьОтчетаJUnit);

	Сообщить(СтрШаблон("Результат прогона фич <%1>
	|", ИтоговыйРезультатВыполнения));

	Возврат ИтоговыйРезультатВыполнения <> ИсполнительБДД.ВозможныеСтатусыВыполнения().Сломался;
КонецФункции // ПрогнатьФичи()

Попытка
	ТестыПрошли = ПрогнатьТесты();

Исключение
	ТестыПрошли = Ложь;
	Сообщить(СтрШаблон("Тесты через 1testrunner выполнены неудачно
	|%1", ПодробноеПредставлениеОшибки(ИнформацияОбОшибке())));
КонецПопытки;

ФичиПрошли = Истина;
// Попытка
// 	ФичиПрошли = ПрогнатьФичи();
// Исключение
// 	ФичиПрошли = Ложь;
// 	Сообщить(СтрШаблон("Тесты поведения через 1bdd выполнены неудачно
// 	|%1", ПодробноеПредставлениеОшибки(ИнформацияОбОшибке())));
// КонецПопытки;

Если Не ТестыПрошли Или Не ФичиПрошли Тогда
	Сообщить("Тестирование завершилось неудачно!");
	ЗавершитьРаботу(1);
Иначе
	Сообщить(СтрШаблон("Результат прогона тестов <%1>
	|", ТестыПрошли));
КонецЕсли;
