
#Использовать ".."

Перем юТест;

Функция ПолучитьСписокТестов(Тестирование) Экспорт
	
	юТест = Тестирование;
	
	СписокТестов = Новый Массив;
	СписокТестов.Добавить("Тест_Должен_ПрочитатьКонфигурационныйФайлИзКаталогаВсехПользователей");
	СписокТестов.Добавить("Тест_Должен_ПрочитатьКонфигурационныйФайлИзКаталогаТекущегоПользователя");
	
	Возврат СписокТестов;
	
КонецФункции

Процедура Тест_Должен_ПрочитатьКонфигурационныйФайлИзКаталогаВсехПользователей() Экспорт

	ПутьЗаготовки = ОбъединитьПути(ТекущийСценарий().Каталог, "fixtures", "allUsers_1CEStart.cfg");
	
	Конфиг = Новый КонфигурацияСтартера();
	Конфиг.Открыть(ПутьЗаготовки);
	
	Список = Конфиг.ПолучитьСписок("InstalledLocation");
	
	юТест.ПроверитьРавенство("C:\Program Files (x86)\1cv82", Список[0]);
	юТест.ПроверитьРавенство("C:\Program Files (x86)\1cv8", Список[1]);
	
	юТест.ПроверитьРавенство("C:\Program Files (x86)\1cv82", Конфиг.ПолучитьЗначение("InstalledLocation"));
	юТест.ПроверитьРавенство("DESIGNERALLCLIENTS=1 LANGUAGES=RU", Конфиг.ПолучитьЗначение("InstallComponents"));

КонецПроцедуры

Процедура Тест_Должен_ПрочитатьКонфигурационныйФайлИзКаталогаТекущегоПользователя() Экспорт
	
	ПутьЗаготовки = ОбъединитьПути(ТекущийСценарий().Каталог, "fixtures", "user_1CEStart.cfg");
	
	Конфиг = Новый КонфигурацияСтартера();
	Конфиг.Открыть(ПутьЗаготовки);
	
	юТест.ПроверитьРавенство("C:\Program Files (x86)\1cv8", Конфиг.ПолучитьЗначение("InstalledLocation"));
	юТест.ПроверитьРавенство("1", Конфиг.ПолучитьЗначение("UseHWLicenses"));
	юТест.ПроверитьРавенство("1", Конфиг.ПолучитьЗначение("AppAutoInstallLastVersion"));
	
	Список = Конфиг.ПолучитьСписок("CommonInfoBases");
	юТест.ПроверитьРавенство("Z:\1C_distr\common.auto.test.v8bases.v8i", Список[0]);
	юТест.ПроверитьРавенство("Z:\1C_distr\common.auto.work.v8bases.v8i", Список[1]);

	
КонецПроцедуры
