#Использовать ".."
#Использовать asserts
#Использовать fs
#Использовать tempfiles

Перем юТест;
Перем УправлениеКонфигуратором;
Перем Лог;

Процедура Инициализация()
	
	УправлениеКонфигуратором = Новый УправлениеКонфигуратором;
	УправлениеКонфигуратором.ИспользоватьВерсиюПлатформы("8.3.10");
	
	// Лог = Логирование.ПолучитьЛог("oscript.lib.v8runner");
	// Лог.УстановитьУровень(УровниЛога.Отладка);

КонецПроцедуры

Функция ПолучитьСписокТестов(Тестирование) Экспорт
	
	юТест = Тестирование;
	
	СписокТестов = Новый Массив;
		
	СписокТестов.Добавить("ТестДолжен_ВыгрузитьКонфигурациюВФайлы");
    СписокТестов.Добавить("ТестДолжен_ВыгрузитьИзмененияКонфигурацииВФайл");
		
	СписокТестов.Добавить("ТестДолжен_ВыгрузитьКонфигурациюВФайлыОтносительноФайлаВерсий");
    СписокТестов.Добавить("ТестДолжен_ВыгрузитьИзмененияКонфигурацииВФайлОтносительноФайлаВерсий");


	Возврат СписокТестов;
	
КонецФункции

Процедура ТестДолжен_ВыгрузитьКонфигурациюВФайлы() 
	
	// ВременныйКаталог = ВременныеФайлы.СоздатьКаталог();

	// УправлениеКонфигуратором.КаталогСборки(ВременныйКаталог);
	
	// КаталогВыгрузки = ОбъединитьПути(ВременныйКаталог, "v8r_TempDitr");
	
	// ПутьФайлКонфигурации = ОбъединитьПути(ТекущийСценарий().Каталог, "fixtures", "1.0\1Cv8.cf");
	
	// УправлениеКонфигуратором.ЗагрузитьКонфигурациюИзФайла(ПутьФайлКонфигурации);
	
	// УправлениеКонфигуратором.ВыгрузитьКонфигурациюВФайлы(КаталогВыгрузки, , ТолькоИзмененные);

	// МассивФайловВыгрузки = НайтиФайлы(КаталогВыгрузки,"*", Истина);
	
	// Лог.Информация("Количество файлов выгрузки: " + МассивФайловВыгрузки.Количество());

	// Утверждения.ПроверитьИстину(МассивФайловВыгрузки.Количество() > 0, "Файл должны существоать");
	


КонецПроцедуры

Процедура ТестДолжен_ВыгрузитьИзмененияКонфигурацииВФайл() 
	
КонецПроцедуры

Процедура ТестДолжен_ВыгрузитьКонфигурациюВФайлыОтносительноФайлаВерсий() 
	
КонецПроцедуры

Процедура ТестДолжен_ВыгрузитьИзмененияКонфигурацииВФайлОтносительноФайлаВерсий() 
	
КонецПроцедуры


/////////////////////////////////////////////////////////////////////////////////////
// Инициализация


Инициализация();