#Использовать ".."
#Использовать asserts
#Использовать tempfiles

Перем юТест;
Перем УправлениеКонфигуратором;
Перем Лог;
Перем мВременнаяВыгрузка;
Перем СуффиксКТестам;

Процедура Инициализация()
	
	УправлениеКонфигуратором = Новый УправлениеКонфигуратором;
	
	Лог = Логирование.ПолучитьЛог("oscript.lib.v8runner");
	Лог.УстановитьУровень(УровниЛога.Отладка);

	СуффиксКТестам = "";
	Попытка
		УправлениеКонфигуратором.ИспользоватьВерсиюПлатформы("8.3.12");
	Исключение
		СуффиксКТестам = "Не_Найдена_Платформа_8_3_12_или_старше";
	КонецПопытки;

КонецПроцедуры

Функция ПолучитьСписокТестов(Тестирование) Экспорт
	
	юТест = Тестирование;
	
	ВремСписокТестов = Новый Массив;
		
	ВремСписокТестов.Добавить("ТестДолжен_ПроверитьВыгрузкуМобильногоПриложенияВФайлZIP");

	СписокТестов = Новый Массив;
	Для каждого ИмяТеста Из ВремСписокТестов Цикл
		СписокТестов.Добавить(ИмяТеста + СуффиксКТестам);
	КонецЦикла;

	Возврат СписокТестов;
	
КонецФункции

Процедура ТестДолжен_ПроверитьВыгрузкуМобильногоПриложенияВФайлZIP() Экспорт

	ВременныйКаталог = ВременныеФайлы.СоздатьКаталог();
	УправлениеКонфигуратором.КаталогСборки(ВременныйКаталог);

	ФайлКонфигурации = ОбъединитьПути(ТекущийСценарий().Каталог, "fixtures", "1.6", "1Cv8.cf");
	УправлениеКонфигуратором.ЗагрузитьКонфигурациюИзФайла(ФайлКонфигурации);
	
	ПутьКАрхиву = ОбъединитьПути(ВременныйКаталог, "1cema.zip");
	УправлениеКонфигуратором.ВыгрузитьМобильноеПриложениеВФайл(ПутьКАрхиву);
	
	Файл = Новый Файл(ПутьКАрхиву);
	Утверждения.ПроверитьИстину(Файл.Существует(), "Файл 1cema.zip не найден");

	УправлениеКонфигуратором.УдалитьВременнуюБазу(); 
	ВременныеФайлы.УдалитьФайл(ВременныйКаталог);

КонецПроцедуры

Инициализация();
